renesas/rx-driver-package/source/r_lpc_rx/r_lpc_rx_vx.xx/r_lpc_rx/src/targets/rx140/r_lpc_rx140.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2021 Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
/*********************************************************************************************************************
 * File Name    : r_lpc_rx140.c
 * Description  : Implementation of the LPC module for the RX140
 **********************************************************************************************************************/
/*********************************************************************************************************************
 * History : DD.MM.YYYY Version Description           
 *         : 31.07.2021 1.00    First Release
 **********************************************************************************************************************/

/*********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 **********************************************************************************************************************/
/* Includes board and MCU related header files. */
#include "platform.h"

#if defined(BSP_MCU_RX140)

/* Public interface header file for this package. */
#include "r_lpc_rx_if.h"
#include "r_lpc_rx_private.h"
#include "r_lpc_rx140_private.h"

/********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/

/********************************************************************************************************************
 Typedef definitions
 *********************************************************************************************************************/

/********************************************************************************************************************
 Private global variables and functions
 *********************************************************************************************************************/
/* See cgc_init_local_data() for the initialization of these arrays */

static lpc_snooze_callback_set_t psnooze_release_callback;  //Snooze interrupt callback function

#if (LPC_CFG_PARAM_CHECKING_ENABLE == 1)
static uint32_t clock_frequency[6];    // Clock source frequencies used by lpc_clockhzget()
static uint32_t hoco_frequency[4];     // Possible HOCO frequencies; Indices 1&2&3 are not used for the RX140.

static uint32_t lpc_clockhzget (lpc_system_clocks_t clock);
static lpc_err_t lpc_freq_range_check (lpc_operating_mode_t e_mode);
static lpc_err_t lpc_lowpower_activate_check (void);
#endif /* LPC_CFG_PARAM_CHECKING_ENABLE */

/********************************************************************************************************************
 * Function Name: lpc_operating_mode_set
 * Description  : This function will configure the MCU for the specified operating mode. In any of the operating
 *                modes, the CPU is running, but the maximum clock frequencies are limited based on the mode.
 *                The supported modes are listed in the lpc_operating_mode_t enum. The modes with the
 *                lower operating frequencies use regulator switches to reduce current draw. It is imperative
 *                that when switching to a higher clock frequency, the mode is changed first to support that
 *                frequency.
 * Arguments    : e_mode - Operating Mode
 *                    LPC_OP_HIGH_SPEED
 *                    LPC_OP_MIDDLE_SPEED
 *                    LPC_OP_MIDDLE_SPEED_2
 *                    LPC_OP_LOW_SPEED
 * Return Value : LPC_SUCCESS -
 *                LPC_ERR_CLOCK_EXCEEDED -
 *                    Clock exceeds the limit of current operating mode
 *                LPC_ERR_P_E_MODE -
 *                    The operation mode can't be changed in P/E mode.
 ********************************************************************************************************************/
lpc_err_t lpc_operating_mode_set (lpc_operating_mode_t e_mode)
{
#if (LPC_CFG_PARAM_CHECKING_ENABLE == 1)
    lpc_err_t err;

    /* Check FENTRY0(b0) and FENTRYD(b7) */
    if (0x0000 != (FLASH.FENTRYR.WORD & 0x0081))
    {
        return LPC_ERR_P_E_MODE;
    }

    err = lpc_freq_range_check(e_mode);
    if (LPC_SUCCESS != err)
    {
        return err;
    }
#endif

    switch (e_mode)
    {
        case LPC_OP_HIGH_SPEED:
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.SOPCCR.BIT.SOPCMTSF)
            {
                /* do not modify SOPCCR if a transition is ongoing */
            }
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.SOPCCR.BIT.SOPCM = 0x0;   // Set to High Speed/Medium Speed/Medium Speed2 Mode
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.SOPCCR.BIT.SOPCMTSF)
            {
                /* wait till transition is complete */
            }
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.OPCCR.BIT.OPCMTSF)
            {
                /* do not modify OPCCR if a transition is ongoing */
            }
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.OPCCR.BIT.OPCM = 0x0;     // Set to High Speed Mode
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.OPCCR.BIT.OPCMTSF)
            {
                /* wait till transition is complete */
            }
        break;
    
        case LPC_OP_MIDDLE_SPEED:
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.SOPCCR.BIT.SOPCMTSF)
            {
                /* do not modify SOPCCR if a transition is ongoing */
            }
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.SOPCCR.BIT.SOPCM = 0x0;   // Set to High Speed/Medium Speed/Medium Speed2 Mode
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.SOPCCR.BIT.SOPCMTSF)
            {
                /* wait till transition is complete */
            }
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.OPCCR.BIT.OPCMTSF)
            {
                /* do not modify OPCCR if a transition is ongoing */
            }
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.OPCCR.BIT.OPCM = 0x02;  // Set to Medium Speed Mode
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.OPCCR.BIT.OPCMTSF)
            {
                /* wait till transition is complete */
            }
        break;

        case LPC_OP_MIDDLE_SPEED_2:
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.SOPCCR.BIT.SOPCMTSF)
            {
                /* do not modify SOPCCR if a transition is ongoing */
            }
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.SOPCCR.BIT.SOPCM = 0x0;   // Set to High Speed/Medium Speed/Medium Speed2 Mode
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.SOPCCR.BIT.SOPCMTSF)
            {
                /* wait till transition is complete */
            }
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.OPCCR.BIT.OPCMTSF)
            {
                /* do not modify OPCCR if a transition is ongoing */
            }
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.OPCCR.BIT.OPCM = 0x04;  // Set to Medium Speed2 Mode
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.OPCCR.BIT.OPCMTSF)
            {
                /* wait till transition is complete */
            }
            break;

        case LPC_OP_LOW_SPEED:
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.SOPCCR.BIT.SOPCMTSF)
            {
                /* do not modify SOPCCR if a transition is ongoing */
            }
            R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
            SYSTEM.SOPCCR.BIT.SOPCM = 0x1;   // Set to Low Speed Mode
            R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
            /* WAIT_LOOP */
            while (LPC_TRANSITION_ONGOING == SYSTEM.SOPCCR.BIT.SOPCMTSF)
            {
                /* wait till transition is complete */
            }
        break;
        
        default:

            /* nothing here */
        break;
    }
    return LPC_SUCCESS;

